** start some where--demo a sin-osc
#+BEGIN_SRC clojure :results silent
(demo 0.1 (sin-osc))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 36>

*** consider the some underappreciated differences about the sounds you will make
UGen vs. SynthNode!
#+BEGIN_SRC clojure
(type (sin-osc))
#+END_SRC

#+RESULTS:
: overtone.sc.machinery.ugen.sc_ugen.SCUGen

#+BEGIN_SRC clojure
(type (noisey))
#+END_SRC

#+RESULTS:
: overtone.sc.node.SynthNode

*** create a very simple instrument to control
#+NAME: def-boop
#+BEGIN_SRC clojure :results silent
(definst boop [note 60 amp 0.3]
  (let [freq (midicps note)]
    (* amp (sin-osc freq))))

#+END_SRC

#+RESULTS:
: #<instrument: boop>

#+BEGIN_SRC clojure
(demo (boop))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 53>

*** you will rely on 'midi-poly-player' to control your instrument
#+BEGIN_SRC clojure :results silent
(def booper (midi-poly-player boop))
#+END_SRC

#+RESULTS:
: #'user/booper

*** It's pretty primitive to listen to tones pile up

Not enough to call =(stop)=, you will want to eliminate this whole
"player," though not the /instrument/. This is a two-step process!

NB. This two-step process, however, will still leave a residue of error messages in the REPL.

You really want to avoid this whole thing and prefer the "event-handler" approach below.

Set that shit to nil!
#+BEGIN_SRC clojure :results silent
(def booper (midi-poly-player nil))
#+END_SRC

#+RESULTS:
: #'user/booper


#+BEGIN_SRC clojure :results silent
(midi-player-stop)
#+END_SRC

#+RESULTS:
: :handler-removed

*** natural sounds have an envelope
    :PROPERTIES:
    :ID:       D4B65EA9-5B5B-488A-A58F-38228AD2B65F
    :END:
but what you really want is a sound that decays!
And that "frees" the "synth" when done.

#+BEGIN_SRC clojure :results silent
(definst steel-drum [note 60 amp 0.8]
  (let [freq (midicps note)]
    (* amp
       (env-gen (perc 0.01 0.2) 1 1 0 1 :action FREE)
       (+ (sin-osc (/ freq 2))
          (rlpf (saw freq) (* 1.1 freq) 0.4)))))
#+END_SRC

#+RESULTS:
: #<instrument: steel-drum>

#+BEGIN_SRC clojure :results silent
(on-event [:midi :note-on]
          (fn [e]
            (let [note (:note e)
                  vel  (:velocity e)]
              (steel-drum note (* 0.01 vel))))
          ::steeldrum-handler)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::steeldrum-handler)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def player (midi-poly-player steel-drum))
#+END_SRC

#+RESULTS:
: #'user/player

#+BEGIN_SRC clojure :results silent
(def player (midi-poly-player nil))
#+END_SRC

#+RESULTS:
: #'user/player


#+BEGIN_SRC clojure :results silent
(midi-player-stop)
#+END_SRC

*** granular synthesis
#+BEGIN_SRC clojure
(def gran-buf (load-sample "/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav"))
#+END_SRC

#+RESULTS:
: #'user/gran-buf


#+BEGIN_SRC clojure
(definst gran [] (play-buf 1 gran-buf))
#+END_SRC

#+RESULTS:
: #<instrument: gran>


#+BEGIN_SRC clojure
(gran)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/gran 68>


#+BEGIN_SRC clojure
  (definst mouse-grainy [b 0]
    (let [trate (mouse-y:kr 1 30)
          dur (/ 2 trate)]
      (t-grains:ar 1 (impulse:ar trate) b 1 (mouse-x:kr 0 (buf-dur:kr b)) dur 0 0.8 2)))


#+END_SRC

#+RESULTS:
: #<instrument: grainy>


#+BEGIN_SRC clojure
(mouse-grainy gran-buf)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/grainy 73>

**** use mouse-x
#+BEGIN_SRC clojure
  (definst grainy-ctl [b 0 trate 1 amp 0.8]
    (let [trate trate
          dur (/ 2 trate)]
      (t-grains:ar 1 (impulse:ar trate) b 1 (mouse-x:kr 0 (buf-dur:kr b)) dur 0 amp 2)))

#+END_SRC

#+RESULTS:
: #<instrument: grainy-ctl>




#+BEGIN_SRC clojure
(grainy-ctl :b 1 :trate 0.25)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/grainy-ctl 63>



#+BEGIN_SRC clojure
(ctl grainy-ctl :trate 0.5)
#+END_SRC

#+RESULTS:
: #overtone.studio.inst.Inst{:name "grainy-ctl", :params ({:name "b", :default 0.0, :rate :kr, :value #atom[0.0 0x6f835023]} {:name "trate", :default 1.0, :rate :kr, :value #atom[1.0 0x5f3815c6]} {:name "amp", :default 0.8, :rate :kr, :value #atom[0.8 0x3e38119f]}), :args ("b" "trate" "amp"), :sdef {:name "user/grainy-ctl", :constants [0.0 2.0 1.0 18.0 0.2], :params (0.0 1.0 0.8), :pnames ({:name "b", :index 0} {:name "trate", :index 1} {:name "amp", :index 2}), :ugens ({:args nil, :special 0, :name "Control", :rate 1, :inputs (), :rate-name :kr, :n-outputs 3, :id 354, :outputs ({:rate 1} {:rate 1} {:rate 1}), :n-inputs 0} #<sc-ugen: impulse:ar [1]> #<sc-ugen: buf-dur:kr [1]> #<sc-ugen: mouse-x:kr [2]> #<sc-ugen: binary-op-u-gen:kr [1]> #<sc-ugen: t-grains:ar [9]> #<sc-ugen: out:ar [10]>)}, :group #<synth-group[live]: Inst grainy-ctl Container 56>, :instance-group #<synth-group[live]: Inst grainy-ctl 57>, :fx-group #<synth-group[live]: Inst grainy-ctl FX 58>, :mixer #<synth-node[live]: overtone.stu547/mono-inst-mixer 59>, :bus #<audio-bus: No Name, mono, id 18>, :fx-chain [], :volume #atom[1.0 0x3a764b06], :pan #atom[0.0 0x3c331f8], :n-chans 1}

*** or you can use instead Supercollider Ugen timing machinery
#+BEGIN_SRC clojure :results silent
(impulse 1)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(definst slow-grain [b 0] 
(t-grains:ar 1 (impulse:ar 1) b 1 (line 0 (buf-dur:kr 0) 300) 1 0 0.8 2))
#+END_SRC



#+BEGIN_SRC clojure
(slow-grain)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/slow-grain 111>


#+BEGIN_SRC clojure :results silent
(definst slow-grain2 [b 0] 
(t-grains:ar 1 (impulse:ar 0.5) b 1 (line 0 (buf-dur:kr 0) 600) 2 0 0.8 4))

(slow-grain2)
#+END_SRC

